JSON exercise

Using data in file 'data/world_bank_projects.json' and the techniques demonstrated above,
1.Find the 10 countries with most projects
2.Find the top 10 major project themes (using column 'mjtheme_namecode')
3.In 2. above you will notice that some entries have only the code and the name is missing. Create a dataframe with the missing names filled in.

## Question 1

In [2]:
import pandas as pd
import json
from pandas.io.json import json_normalize

In [3]:
#Loading file in Dataframe.
world_bank_df=pd.read_json('data/world_bank_projects.json')

In [4]:
#checking how the data look
world_bank_df.head(5)

,_id,approvalfy,board_approval_month,boardapprovaldate,borrower,closingdate,country_namecode,countrycode,countryname,countryshortname,...,sectorcode,source,status,supplementprojectflg,theme1,theme_namecode,themecode,totalamt,totalcommamt,url
0,{'$oid': '52b213b38594d8a2be17c780'},1999,November,2013-11-12T00:00:00Z,FEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA,2018-07-07T00:00:00Z,Federal Democratic Republic of Ethiopia!$!ET,ET,Federal Democratic Republic of Ethiopia,Ethiopia,...,"ET,BS,ES,EP",IBRD,Active,N,"{'Percent': 100, 'Name': 'Education for all'}","[{'code': '65', 'name': 'Education for all'}]",65,130000000,130000000,http://www.worldbank.org/projects/P129828/ethi...
1,{'$oid': '52b213b38594d8a2be17c781'},2015,November,2013-11-04T00:00:00Z,GOVERNMENT OF TUNISIA,NaN,Republic of Tunisia!$!TN,TN,Republic of Tunisia,Tunisia,...,"BZ,BS",IBRD,Active,N,"{'Percent': 30, 'Name': 'Other economic manage...","[{'code': '24', 'name': 'Other economic manage...","54,24",0,4700000,http://www.worldbank.org/projects/P144674?lang=en
2,{'$oid': '52b213b38594d8a2be17c782'},2014,November,2013-11-01T00:00:00Z,MINISTRY OF FINANCE AND ECONOMIC DEVEL,NaN,Tuvalu!$!TV,TV,Tuvalu,Tuvalu,...,TI,IBRD,Active,Y,"{'Percent': 46, 'Name': 'Regional integration'}","[{'code': '47', 'name': 'Regional integration'...","52,81,25,47",6060000,6060000,http://www.worldbank.org/projects/P145310?lang=en
3,{'$oid': '52b213b38594d8a2be17c783'},2014,October,2013-10-31T00:00:00Z,MIN. OF PLANNING AND INT'L COOPERATION,NaN,Republic of Yemen!$!RY,RY,Republic of Yemen,"Yemen, Republic of",...,JB,IBRD,Active,N,"{'Percent': 50, 'Name': 'Participation and civ...","[{'code': '57', 'name': 'Participation and civ...","59,57",0,1500000,http://www.worldbank.org/projects/P144665?lang=en
4,{'$oid': '52b213b38594d8a2be17c784'},2014,October,2013-10-31T00:00:00Z,MINISTRY OF FINANCE,2019-04-30T00:00:00Z,Kingdom of Lesotho!$!LS,LS,Kingdom of Lesotho,Lesotho,...,"FH,YW,YZ",IBRD,Active,N,"{'Percent': 30, 'Name': 'Export development an...","[{'code': '45', 'name': 'Export development an...","41,45",13100000,13100000,http://www.worldbank.org/projects/P144933/seco...

In [5]:
#For finding the 10 countries with most projects, getting the total count of each country.
world_bank_df.countryname.value_counts().head(10)

Republic of Indonesia              19
People's Republic of China         19
Socialist Republic of Vietnam      17
Republic of India                  16
Republic of Yemen                  13
Kingdom of Morocco                 12
People's Republic of Bangladesh    12
Nepal                              12
Africa                             11
Republic of Mozambique             11
Name: countryname, dtype: int64

## Question 2

In [6]:
#getting the json data from json file
jason_data=json.load(open('data/world_bank_projects.json'))
norm_data=json_normalize(jason_data,'mjtheme_namecode')

In [7]:
norm_data.head()

  code                                   name
0    8                      Human development
1   11
2    1                    Economic management
3    6  Social protection and risk management
4    5                  Trade and integration

In [8]:
#getting the total counts of each code
theme_total=norm_data.code.value_counts()

In [9]:
theme_total.head(10)

11    250
10    216
8     210
2     199
6     168
4     146
7     130
5      77
9      50
1      38
Name: code, dtype: int64

In [10]:
#changing the name from 'code' to 'counts'
theme_total.name='counts'

In [11]:
#groupingby code and taking the last value
theme_name=norm_data.groupby('code').last()

In [12]:
print(theme_name)

                                              name
code
1
10                               Rural development
11    Environment and natural resources management
2                         Public sector governance
3                                      Rule of law
4         Financial and private sector development
5                            Trade and integration
6
7                      Social dev/gender/inclusion
8                                Human development
9                                Urban development

In [13]:
#using datarame to find the top 10 major themes
theme_code_df=pd.DataFrame([theme_name['name'],theme_total]).transpose().sort_values('counts',ascending=False)

In [14]:
theme_code_df.head(10)

                                            name counts
11  Environment and natural resources management    250
10                             Rural development    216
8                              Human development    210
2                       Public sector governance    199
6                                                   168
4       Financial and private sector development    146
7                    Social dev/gender/inclusion    130
5                          Trade and integration     77
9                              Urban development     50
1                                                    38

## Question 3

In [16]:
#using the normalize data and removing missing and duplicates
norm_data2=norm_data[norm_data.name !=''].drop_duplicates()

In [18]:
norm_data2.head()

  code                                   name
0    8                      Human development
2    1                    Economic management
3    6  Social protection and risk management
4    5                  Trade and integration
5    2               Public sector governance

In [19]:
#merging the two data on 'code'
merge_data=norm_data.merge(norm_data2,on='code')

In [20]:
merge_data.head()

  code             name_x             name_y
0    8  Human development  Human development
1    8                     Human development
2    8  Human development  Human development
3    8  Human development  Human development
4    8  Human development  Human development

In [21]:
#considering the two desired columns with the filled name
merge_data_final=merge_data[['code','name_y']]

In [22]:
merge_data_final.head()

  code             name_y
0    8  Human development
1    8  Human development
2    8  Human development
3    8  Human development
4    8  Human development

In [23]:
merge_data_final.columns=['code','name']

In [24]:
merge_data_final.head()

  code               name
0    8  Human development
1    8  Human development
2    8  Human development
3    8  Human development
4    8  Human development